
## Plan Result (aat)




<pre><code>Plan: 3 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.prl-citizen-frontend-secondary-session-storage.azurerm_private_endpoint.this[0]
  * module.prl-citizen-frontend-secondary-session-storage.azurerm_redis_cache.redis
  * module.prl-citizen-frontend-secondary-session-storage.azurerm_resource_group.cache-resourcegroup[0]
* Update
  * azurerm_key_vault_secret.redis_access_key
  * module.prl-citizen-frontend-session-storage.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_access_key" {
        id                      = "https://prl-aat.vault.azure.net/secrets/redis-access-key/b9b4d4466c744c0e8a6a65fa310d1bd3"
        name                    = "redis-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.prl-citizen-frontend-secondary-session-storage.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "prl-citizen-frontend-secondary-redis-aat"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "prl-citizen-frontend-secondary-redis-cache-aat"
      + subnet_id                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-2-aat"
      + tags                     = {
          + "application"         = "family-private-law"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#prl-tech-notifications"
          + "environment"         = "staging"
          + "managedBy"           = "Private Law"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "redis-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "prl-citizen-frontend-secondary-redis-aat"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.prl-citizen-frontend-secondary-session-storage.azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "prl-citizen-frontend-secondary-redis-aat"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = false
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "prl-citizen-frontend-secondary-redis-cache-aat"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Basic"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "application"         = "family-private-law"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#prl-tech-notifications"
          + "environment"         = "staging"
          + "managedBy"           = "Private Law"
        }

      + redis_configuration {
          + data_persistence_authentication_method = "SAS"
          + enable_authentication                  = true
          + maxclients                             = (known after apply)
          + maxfragmentationmemory_reserved        = 642
          + maxmemory_delta                        = 642
          + maxmemory_policy                       = "volatile-lru"
          + maxmemory_reserved                     = 642
        }
    }

  # module.prl-citizen-frontend-secondary-session-storage.azurerm_resource_group.cache-resourcegroup[0] will be created
  + resource "azurerm_resource_group" "cache-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "prl-citizen-frontend-secondary-redis-cache-aat"
      + tags     = {
          + "application"         = "family-private-law"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#prl-tech-notifications"
          + "environment"         = "staging"
          + "managedBy"           = "Private Law"
        }
    }

  # module.prl-citizen-frontend-session-storage.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-citizen-frontend-redis-cache-aat/providers/Microsoft.Cache/redis/prl-citizen-frontend-redis-aat"
        name                          = "prl-citizen-frontend-redis-aat"
        tags                          = {
            "application"         = "family-private-law"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#prl-tech-notifications"
            "environment"         = "staging"
            "managedBy"           = "Private Law"
        }
        # (23 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved         = 125 -> 642
          ~ maxmemory_delta                         = 125 -> 642
          ~ maxmemory_reserved                      = 125 -> 642
            # (14 unchanged attributes hidden)
        }
    }

Plan: 3 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":42,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->